import os
import pandas as pd
def get_suisen(file, major):

    SYSTEM = "システム主専攻"
    TISIKI = "知識科学主専攻"
    SIGEN = "情報資源経営主専攻"

    syusenkou = major

    df = pd.read_csv(file, encoding='cp932')
    df.columns = df.columns.str.strip()

    # 合計単位数
    total_credits = df['単位数'].sum()
    print(f"合計単位数:{total_credits}単位")

    # 対象データ
    system_sample_data = [
        ["GE60601", "GE60801", "GE61101", "GE70301", "GE70401", "GE73201", "GE70501", "GE70601", "GE70701", "GE71001", "GE72501", "GE72801", "GE80501", "GE82601"],
        ["GE61101", "GE61801", "GE61901", "GE70201", "GE70401", "GE70601", "GE71001", "GE71101", "GE72801", "GE82601", "GE80801", "GE80901", "GE81101", "GE81301", "GE40401"],
        ["GE61101", "GE61801", "GE61901", "GE62001", "GE70201", "GE70301", "GE70401", "GE73201", "GE70501", "GE70701", "GE70801", "GE71001", "GE71101", "GE72801", "GE71901", "GE81201", "GE40401"],
        ["GE60201", "GE61101", "GE62301", "GE70301", "GE73201", "GE70501", "GE70601", "GE70701", "GE71101", "GE72501", "GE72601", "GE72801", "GE71901", "GA40503", "GA40603"],
        ["GE73201", "GE70501", "GE70701", "GE72601", "GE72801", "GE71901", "GA40103", "GA40203", "GA40503", "GA40603"],
        ["GE62601", "GE61801", "GE62401", "GE70601", "GE70701", "GE72701", "GE70801", "GE70901", "GE71001", "GE71101", "GE72601", "GE72801", "GE71801", "GE80301", "GE80501", "GE80901"],
        ["GE61101", "GE61801", "GE70201", "GE70301", "GE70501", "GE70601", "GE70701", "GE70801", "GE70901", "GE71001", "GE72801", "GE80901", "GE81401", "GA40603", "GA40803", "GE40501"],
        ["GE61101", "GE70301", "GE70401", "GE70501", "GE70701", "GE70801", "GE71001", "GE72801", "GE40201", "GE40301", "GE40401", "GE40501"],
        ["GE60601", "GE61801", "GE61901", "GE70201", "GE70401", "GE73201", "GE70501", "GE70701", "GE71001", "GE71901", "GE81301", "GE40201", "GE40401"],
        ["GE60601", "GE70201", "GE70301", "GE70401", "GE70501", "GE70601", "GE71001", "GE71901", "GE81201", "GE40201", "GE40401", "GE40501"]
    ]

    shigen_sample_data = [
        ["GE60201","GE60601","GE61101","GE70401","GE73201","GE80301","GE80501","GE82601","GE80801","GE80901","GE82802","GE81101","GE81201","GE82901","GE40201","GE40301","GE40401","GE40603","GE40703"],
        ["GE60201","GE60601","GE62201","GE61101","GE80301","GE80501","GE82601","GE80801","GE80901","GE82802","GE81101","GE81201","GE81301","GE81401","GE82901","GE83001","GE40201","GE40301","GE40401","GE40603"],
        ["GE60201","GE60501","GE60601","GE62701","GE61101","GE80301","GE80501","GE82601","GE80801","GE80901","GE81101","GE81201","GE81301","GE82901","GE40201","GE40301","GE40401","GE40501","GE40603"],
        ["GE60201","GE60601","GE62601","GE61101","GE70501","GE70601","GE70701","GE70801","GE80501","GE72601","GE80901","GE81101","GE81201","GE81301","GE81401","GE40201","GE40301","GE40401","GE40501","GE40603"],
        ["GE60201","GE60801","GE70501","GE70601","GE80301","GE80501","GE82601","GE80801","GE80901","GE81201","GE81301","GE81401","GE82901","GE83001","GE40301","GE40401","GE40603"]
    ]

    kagaku_sample_data = [
        ["GE60201","GE60501","GE60601","GE60801","GE61301","GE61801","GE61901","GE80301","GE80501","GE82601","GE80901","GE40401"],
        ["GE60201","GE60501","GE60601","GE60801","GE61101","GE61801","GE61901","GE70501","GE80801","GE81201","GE82901","GE40501"],
        ["GE60201","GE60501","GE60601","GE62601","GE61101","GE61901","GE73201","GE70601","GEGE80501","GE81201","GE81301","GE82901","GE83001"],
        ["GE60201","GE60501","GE60601","GE62201","GE61101","GE61301","GE61901","GE70401","GE82601","GE81101","GE82901"],
        ["GE60201","GE60501","GE60601","GE62601","GE60801","GE61101","GE61301","GE80301","GE80501","GE82601","GE80901","GE81101","GE81201","GE81401","GE82901","GE83001","GE40401"]
    ]


    tenchi_system = [
    [['GA40103'], [4]],
    [['GA40203'], [4]],
    [['GA40503'], [3, 4]],
    [['GA40603'], [3, 4, 6]],
    [['GA40803'], [6]],
    [['GE40201'], [7, 8, 9]],
    [['GE40301'], [7]],
    [['GE40401'], [1, 2, 7, 8, 9]],
    [['GE40501'], [6, 7, 9]],
    [['GE60201'], [3]],
    [['GE60601'], [0, 8, 9]],
    [['GE60801'], [0]],
    [['GE61101'], [0, 1, 2, 3, 6, 7]],
    [['GE61801'], [1, 2, 5, 6, 8]],
    [['GE61901'], [1, 2, 8]],
    [['GE62001'], [2]],
    [['GE62301'], [3]],
    [['GE62401'], [5]],
    [['GE62601'], [5]],
    [['GE70201'], [1, 2, 6, 8, 9]],
    [['GE70301'], [0, 2, 3, 6, 7, 9]],
    [['GE70401'], [0, 1, 2, 7, 8, 9]],
    [['GE70501'], [0, 2, 3, 4, 6, 7, 8, 9]],
    [['GE70601'], [0, 1, 3, 5, 6, 9]],
    [['GE70701'], [0, 2, 3, 4, 5, 6, 7, 8]],
    [['GE70801'], [2, 5, 6, 7]],
    [['GE70901'], [5, 6]],
    [['GE71001'], [0, 1, 2, 5, 6, 7, 8, 9]],
    [['GE71101'], [1, 2, 3, 5]],
    [['GE71801'], [5]],
    [['GE71901'], [2, 3, 4, 8, 9]],
    [['GE72501'], [0, 3]],
    [['GE72601'], [3, 4, 5]],
    [['GE72701'], [5]],
    [['GE72801'], [0, 1, 2, 3, 4, 5, 6, 7]],
    [['GE73201'], [0, 2, 3, 4, 8]],
    [['GE80301'], [5]],
    [['GE80501'], [0, 5]],
    [['GE80801'], [1]],
    [['GE80901'], [1, 5, 6]],
    [['GE81101'], [1]],
    [['GE81201'], [2, 9]],
    [['GE81301'], [1, 8]],
    [['GE81401'], [6]],
    [['GE82601'], [0, 1]],
]


    

    tenchi_shigen = [
        [['GE40201'], [0, 1, 2, 3]],
        [['GE40301'], [0, 1, 2, 3, 4]],
        [['GE40401'], [0, 1, 2, 3, 4]],
        [['GE40501'], [2, 3]],
        [['GE40603'], [0, 1, 2, 3, 4]],
        [['GE40703'], [0]],
        [['GE60201'], [0, 1, 2, 3, 4]],
        [['GE60501'], [2]],
        [['GE60601'], [0, 1, 2, 3]],
        [['GE60801'], [4]],
        [['GE61101'], [0, 1, 2, 3]],
        [['GE62201'], [1]],
        [['GE62601'], [3]],
        [['GE62701'], [2]],
        [['GE70401'], [0]],
        [['GE70501'], [3, 4]],
        [['GE70601'], [3, 4]],
        [['GE70701'], [3]],
        [['GE70801'], [3]],
        [['GE72601'], [3]],
        [['GE73201'], [0]],
        [['GE80301'], [0, 1, 2, 4]],
        [['GE80501'], [0, 1, 2, 3, 4]],
        [['GE80801'], [0, 1, 2, 4]],
        [['GE80901'], [0, 1, 2, 3, 4]],
        [['GE81101'], [0, 1, 2, 3]],
        [['GE81201'], [0, 1, 2, 3, 4]],
        [['GE81301'], [1, 2, 3, 4]],
        [['GE81401'], [1, 3, 4]],
        [['GE82601'], [0, 1, 2, 4]],
        [['GE82802'], [0, 1]],
        [['GE82901'], [0, 1, 2, 4]],
        [['GE83001'], [1, 4]]
    ]

    tenchi_kagaku = [
        [['GE40401'], [0, 4]],
        [['GE40501'], [1]],
        [['GE60201'], [0, 1, 2, 3, 4]],
        [['GE60501'], [0, 1, 2, 3, 4]],
        [['GE60601'], [0, 1, 2, 3, 4]],
        [['GE60801'], [0, 1, 4]],
        [['GE61101'], [1, 2, 3, 4]],
        [['GE61301'], [0, 3, 4]],
        [['GE61801'], [0, 1]],
        [['GE61901'], [0, 1, 2, 3]],
        [['GE62201'], [3]],
        [['GE62601'], [2, 4]],
        [['GE70401'], [3]],
        [['GE70501'], [1]],
        [['GE70601'], [2]],
        [['GE73201'], [2]],
        [['GE80301'], [0, 4]],
        [['GE80501'], [0, 4]],
        [['GE80801'], [1]],
        [['GE80901'], [0, 4]],
        [['GE81101'], [3, 4]],
        [['GE81201'], [1, 2, 4]],
        [['GE81301'], [2]],
        [['GE81401'], [4]],
        [['GE82601'], [0, 3, 4]],
        [['GE82901'], [1, 2, 3, 4]],
        [['GE83001'], [2, 4]],
        [['GE80501'], [2]]
    ]

    if syusenkou == SYSTEM:
        sample_data = system_sample_data
        tenchi = tenchi_system
    elif syusenkou == SIGEN:
        sample_data = shigen_sample_data
        tenchi = tenchi_shigen
    else:
        sample_data = kagaku_sample_data
        tenchi = tenchi_kagaku


    # 科目番号を文字列リスト化
    yy = df["科目番号"].astype(str).tolist()

    gacchi = []  # 各サンプルの履修率を保存するリスト

    for samp in sample_data:  # 各サンプルについて処理する
        count = 0  # 履修済み（yyに含まれている）科目の数をカウントする変数

        for cls in samp:  # サンプル内の各クラスを1つずつ確認
            if cls in yy:  # そのクラスが履修済みであれば
                count += 1  # カウントを1増やす

        total = len(samp)  # サンプル内の総クラス数
        rate = count / total  # 履修率（= 該当数 / 総数）を計算
        gacchi.append(rate)  # 結果リストに履修率を追加

    # 未履修科目に対して推薦度計算
    pro = []
    for i in tenchi:
        if i[0][0] not in yy:
            v = sum(gacchi[j] for j in i[1])
            gacchiritu = v / len(i[1])  # 合致率の平均を算出
            pro.append([i[0], gacchiritu])

    # 推薦度でソート
    sorted_data = sorted(pro, key=lambda x: x[1], reverse=True)

    zisyusenkou = []
    tasyusenkou = []

    if syusenkou == SYSTEM:
        # GE7で始まるもの → 自主専攻（zisyusenkou）
        zisyusenkou = [item for item in sorted_data if item[0][0].startswith('GE7')]
        # 上記以外 → 他専攻（tasyusenkou）
        tasyusenkou = [item for item in sorted_data if item not in zisyusenkou]
    elif syusenkou == SIGEN:
        # GE8で始まるもの → 自主専攻（zisyusenkou）
        zisyusenkou = [item for item in sorted_data if item[0][0].startswith('GE8')]
        tasyusenkou = [item for item in sorted_data if item not in zisyusenkou]
    else:  # 科学
        # GE6で始まるもの → 自主専攻（zisyusenkou）
        zisyusenkou = [item for item in sorted_data if item[0][0].startswith('GE6')]
        tasyusenkou = [item for item in sorted_data if item not in zisyusenkou]

    return [zisyusenkou, tasyusenkou]    
